* Tasks
** TODO seer -> seer migration

*** TODO Migrate to docket
**** DONE Write docket and bill
:LOGBOOK:
CLOCK: [2021-09-13 Mon 12:57]--[2021-09-13 Mon 16:23] =>  3:26
:END:
**** TODO Make glob
**** TODO Clarify eyre bindings
**** TODO Remove file-server
**** TODO Remove launch actions
**** TODO Update state
**** TODO Make changes to docket

***** NEXT Store glob in spot
:LOGBOOK:
CLOCK: [2021-10-25 Mon 16:16]--[2021-10-28 Thu 16:58] => 72:42
CLOCK: [2021-10-25 Mon 15:58]--[2021-10-25 Mon 16:04] =>  0:06
CLOCK: [2021-10-25 Mon 10:53]--[2021-10-25 Mon 15:57] =>  5:04
:END:
instead of  storing the glob reference in the =href= of the docket structure, we should
store it in =spot= and populate a =chad= from there. this means adding a new
attribute to the docket mold called =spot= and modifying lib/docket
accordingly.

=chad= will still hold the actual glob, and the structure of the docket file
itself will remain unchanged.

* Install
:PROPERTIES:
:header-args: :dir /home/jake/vault/projects/urbit/git/urbit/
:header-args: :results output
:END:
** unix install


Copy into the urbit/urbit repo so that dependencies can be symlinked without
messing with the app source.

#+begin_src sh
watch cp -RL /home/jake/vault/projects/srrs/urbit/* pkg/seer/
watch cp -RL pkg/seer/* /mnt/laptop-sandisk/zod/seer/
#+end_src

#+begin_src sh
# Assumes you are in the urbit/urbit git repo
cd pkg
# rm -rf ./seer/*
# cp -R ~/vault/projects/seer/urbit/* ./seer
./symbolic-merge.sh ./garden-dev ./seer # for docket agent
./symbolic-merge.sh ./landscape ./seer # for stuff like group-store
#+end_src

#+results:

#+begin_src sh
ls ./pkg/seer
#+end_src

Metadata files

#+begin_src sh :results none
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/zod/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/zod/seer/
#+end_src

Base
#+begin_src shell

#+end_src

Source files. Ensure we don't accidently include files we do not have marks for.

#+begin_src sh :results none
cd pkg/seer

find -L -type f \( -name \*.hoon\* -o -name \*.png\* -o -name \*.html\* -o -name \*.js\* \) -exec cp -v --parents -RL {} /mnt/laptop-sandisk/marzod/seer \;
#+end_src



** Initial Setup
*** urbit install
create new desk and mount.

#+begin_src tmux
|merge %seer our %base
|mount %seer
#+end_src

symlink the garden dev and landscape desk into the seer desk.

#+begin_src sh
cd pkg
./symbolic-merge.sh ./garden-dev ./seer
./symbolic-merge.sh ./landscape ./seer

#+end_src

#+results:

Remove files from seer desk
#+begin_src sh :results none
rm -rf /mnt/laptop-sandisk/zod/seer/*
#+end_src


copy metadata files into mounted unix path
#+begin_src sh :results none
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/samzod/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/samzod/seer/
#+end_src

Copy hoon files into mounted unix path. this is to ensure we don't accidently include files we do not have marks for.

#+begin_src sh :results none
cd pkg/seer

find -L -type f \( -name \*.hoon\* -o -name \*.png\* -o -name \*.html\* -o -name \*.js\* \) -exec cp -v --parents -RL {} /mnt/laptop-sandisk/samzod/seer \;
#+end_src

#+begin_src tmux
+cat /=seer=/sys/kelvin
+ls /=seer=
|commit %seer
#+end_src

Run globulator.

switch to the garden desk and publish

#+begin_src tmux
=dir /=garden
:treaty|garden!publish %seer
#+end_src

install seer
#+begin_src tmux
|install our %seer
#+end_src


*** unix install
Mirror the desk setup found in pkg/<desk>

#+begin_src sh
ls pkg/garden
#+end_src

#+results:
| app         |
| desk.bill   |
| desk.docket |
| gen         |
| lib         |
| mar         |
| sur         |
| sys.kelvin  |
| ted         |

#+begin_src sh
cd pkg
rm -rf ./seer/*
cp -R ~/vault/projects/seer/urbit/* ./seer
./symbolic-merge.sh ./garden-dev ./seer
./symbolic-merge.sh ./landscape ./seer
ls seer/mar
#+end_src

#+begin_src sh
ls ./pkg/seer
#+end_src

#+results:
| app         |
| desk.bill   |
| desk.docket |
| gen         |
| lib         |
| mar         |
| seer.org    |
| sur         |
| urbit       |

Missing desk.docket, desk.bill, and sys.kelvin.

#+begin_src sh :results none
cp pkg/garden/desk.* ./pkg/seer
cp pkg/garden/sys.kelvin ./pkg/seer
#+end_src

#+begin_src sh
ls ./pkg/seer
#+end_src

#+results:
| app |
| gen |
| lib |
| mar |
| sur |
#+begin_src sh :results none
cp pkg/garden/sys.kelvin ./pkg/seer
cp -Rn pkg/seer/desk.* /mnt/laptop-sandisk/samzod/seer/
cp -Rn pkg/seer/sys.kelvin /mnt/laptop-sandisk/samzod/seer/
#+end_src

Check docket and bill files
#+begin_src zsh :results output replace :dir /home/jake/vault/projects/urbit/git/urbit/pkg/seer
cat desk.docket
cat desk.bill
#+end_src

#+results:
#+begin_example
:~  title+'Garden'
    info+'An app launcher for Urbit.'
    color+0xee.5432
    glob-http+'https://bootstrap.urbit.org/glob-0v2.dne76.9hibl.1o442.h6l11.cn7os.glob'
    ::glob-ames+~zod
    base+'grid'
    version+[0 0 1]
    website+'https://tlon.io'
    license+'MIT'
==
:~  :-  %apes
    :~  %docket
        %treaty
        %settings-store
    ==
    :-  %fish  ~
==
#+end_example
*** Manifests
:PROPERTIES:
:header-args: :dir /home/jake/vault/projects/urbit/git/urbit/pkg/seer
:END:

Define the docket and the bill for the desk.

#+begin_src hoon :tangle /home/jake/vault/projects/urbit/git/urbit/pkg/seer/desk.docket
:~  title+'Seer'
    info+'Your brain on urbit'
    color+0xee.5432

glob-http+'https://bootstrap.urbit.org/glob-0v2.dne76.9hibl.1o442.h6l11.cn7os.glob'
    ::glob-ames+~zod
    base+'seer'
    version+[0 0 1]
    website+'https://urbit.land'
    license+'MIT'
==
#+end_src

#+begin_src zsh :tangle /home/jake/vault/projects/urbit/git/urbit/pkg/seer/desk.bill
:~  :-  %apes
    :~  %seer
        %seer-cli
    ==
    :-  %fish  ~
==

#+end_src

#+begin_src zsh :results output
cat desk.docket
cat desk.bill
#+end_src

#+results:
#+begin_example
:~  title+'Seer'
    info+'Your brain on urbit'
    color+0xee.5432
    glob-http+'https://bootstrap.urbit.org/glob-0v2.dne76.9hibl.1o442.h6l11.cn7os.glob'
    ::glob-ames+~zod
    base+'seer'
    version+[0 0 1]
    website+'https://urbit.land'
    license+'MIT'
==
:~  :-  %apes
    :~  %seer
        %seer-cli
    ==
    :-  %fish  ~
==
#+end_example
*** Desk Install
**** Dev install
:PROPERTIES:
:header-args: :dir /home/jake/vault/projects/urbit/git/urbit/
:END:
Do this if not booting with a multi-desk pill containing the necessary desks.

Unmount if necessary.

#+begin_src tmux
|unmount %base-dev
|unmount %garden
|unmount %landscape
#+end_src

Create desks and mount.
#+begin_src tmux
|merge %base-dev our %base
|merge %garden our %base
|merge %landscape our %base
|merge %seer our %base
|mount %base-dev
|mount %garden
|mount %landscape
|mount %seer
#+end_src



#+results:

#+begin_src sh :results none
unalias cp

rm -rf /mnt/laptop-sandisk/zod/garden/*
rm -rf /mnt/laptop-sandisk/zod/base/*
yes | cp -RL pkg/garden/* /mnt/laptop-sandisk/zod/garden/
yes | cp -RL pkg/arvo/* /mnt/laptop-sandisk/zod/base/
#+end_src
#+begin_src sh :results none
unalias cp
rm -rf /mnt/laptop-sandisk/zod/seer/*
yes | cp -RL pkg/seer/* /mnt/laptop-sandisk/zod/seer/
#+end_src
#+begin_src sh
unalias cp
rm -rf /mnt/laptop-sandisk/dopzod/base/*
yes | cp -RL pkg/arvo/* /mnt/laptop-sandisk/dopzod/base/
rm -rf /mnt/laptop-sandisk/dopzod/garden/*
yes | cp -RL pkg/garden/* /mnt/laptop-sandisk/dopzod/garden/

#+end_src

#+results:

#+begin_src tmux
|commit %base
|commit %garden
#+end_src
#+results:

#+begin_src sh
yes | cp -RL /mnt/laptop-sandisk/zod-old/base/* /mnt/laptop-sandisk/zod/base/
yes | cp -RL /mnt/laptop-sandisk/zod-old/garden/* /mnt/laptop-sandisk/zod/garden/
#+end_src

#+results:

#+begin_src tmux
|commit %base-dev
|commit %garden
|commit %landscape
|merge %seer our %base-dev
|merge %seer our %landscape
|commit %seer


#+end_src

#+begin_src tmux
=d -build-file /=base-dev=/lib/docket/hoon
=io -build-file /=desk=/lib/agentio/hoon
=desk %garden
=desk %garden
=loc [%ship ~zod]
=tid (cat 3 'docket-' (scot %uv (sham (mix eny desk)))))
=b *beak
:spider|start %glob !>(`[loc desk])]
:spider|start %glob !>(`[%http])]

#+end_src
#+begin_src tmux
=dir
|commit %garden
=dir /=garden
-glob [[%ames ~dopzod] %seer]
=dir
#+end_src

#+begin_src tmux
=d -build-file /=base-dev=/lib/docket/hoon


#+end_src

tadnul-nismyn-dabryn-balhes


#+begin_src tmux
        [ %give
            p
          ?(
            [%fact paths=it(/) cage=[p=@tas q=[#t q=*]]]
            [%kick paths=it(/) ship=u(@p)]
            [%poke-ack p=u(it(#13))]
            [%watch-ack p=u(it(#13))]
          )
        ]
[ [[%give %fact [[i=%~.glob t=[i=@ta t=%~]] %~] %glob #t q=*] %~]
  [[%give %kick [[i=%~.glob t=[i=@ta t=%~]] %~] %~] %~]
  %~
]

#+end_src

*** Changes
- No more chat store
- had to symlink landscape
